Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/government_in_ireland/elections_and_referenda/national_elections/seanad_elections.html.txt.tmx
Source language: en
Languages: ga

source: A Seanad election takes place up to 90 days after Dáil Éireann has dissolved
ga: Bíonn toghchán de chuid an tSeanaid ar siúl suas go dtí 90 lá tar éis do Dháil Éireann lánscor

source: This means that the new Dáil has assembled before the Seanad election takes place
ga: Ciallaíonn seo go dtagann an Dáil nua le chéile sula mbíonn toghcháin an tSeanaid ar siúl

source: The Seanad has 60 members
ga: Tá 60 ball ag an Seanad

source: The Taoiseach nominates 11 members, 6 are elected by university graduates and 43 in Seanad panel elections
ga: Ainmnítear 11 ball ag an Taoiseach, déantar 6 a thoghadh ag céimithe ollscoileanna agus 43 i dtoghcháin le haghaidh painéil an tSeanaid

source: In 2014 a Working Group on Seanad Reform was established
ga: Sa bhliain 2014, bhunaigh an Rialtas Grúpa Oibre ar Leasú an tSeanaid
